# 파이썬 기초 순서 <= ( 주석: 코멘트)
# 파이썬은 인터프리터 언어
# 한줄 한줄 수행이 된다.
''' 여러줄 주석
ㅁㅇㄻㅇㄹ
'''
"""
파이썬 학습 순서 
1. 단일 데이터 ->변수가 등장.
    - 수치형
    - 문자형
2. 연속 데이터
    - 리스트    []
    - 딕셔너리   {}
    - 튜플      ()
    - 집합      {}
---------------------------------------------------------
3. 블린(참/거짓)
    - 조건문
    - 반복문
    - 실습 (게임을 통해서 절차적 프로그램 습득)
4. 함수
    - 기본룰,
    - 내장함수, 외장함수(모듈)
    - 실습 (게임을 통해서 함수 지향적 프로그램 습득)
5. 클래스, 객체
    - 모듈화
    - 패키지
    - 예외처리
    - 실습 (객체 지향 프로그램(뒤로 미룰 수도 있다.))
"""
